RIET/src/Enums/ТипыЗаказа/ТипыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказа</name>
  <enumValues>
    <name>E</name>
  </enumValues>
  <enumValues>
    <name>I</name>
  </enumValues>
  <enumValues>
    <name>A</name>
  </enumValues>
  <enumValues>
    <name>R</name>
  </enumValues>
  <enumValues>
    <name>X</name>
  </enumValues>
  <enumValues>
    <name>S</name>
  </enumValues>
  <enumValues>
    <name>U</name>
  </enumValues>
  <enumValues>
    <name>V</name>
  </enumValues>
  <enumValues>
    <name>RAN</name>
  </enumValues>
  <enumValues>
    <name>LOAN</name>
  </enumValues>
  <enumValues>
    <name>FMT</name>
  </enumValues>
  <enumValues>
    <name>FAT</name>
  </enumValues>
  <enumValues>
    <name>SS</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/LegalEntities/LegalEntities.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>LegalEntities</name>
  <predefined>
    <items>
      <name>OIES</name>
      <description>OILFIELD INTERNATIONAL EQUIPMENT &amp; SUPPLIES INC. (OP0114)</description>
    </items>
    <items>
      <name>PES_FZE</name>
      <description>PETROLEUM EQUIPMENT AND SUPPLIES (OP0399)</description>
    </items>
    <items>
      <name>STC</name>
      <description>SCHLUMBERGER TECHNOLOGY CORPORATION (OP0001)</description>
    </items>
    <items>
      <name>SRP_FZE</name>
      <description>SLB RESERVOIR PRODUCTION FZE (OP0311)</description>
    </items>
  </predefined>
  <attributes>
    <name>SoldToAddress</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountryCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ERPID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FinanceLocCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FinanceProcess</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ParentCompany</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ReplaceWIth</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>NameRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldToAddressRus</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CostCenter</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RechargeToLegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>RechargeToAU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>RechargeToActivity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/ConsignTo/ConsignTo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ConsignTo</name>
  <owners>Catalog.SoldTo</owners>
  <attributes>
    <name>Address1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CityLocation</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DoNotRequireContractInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMSID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EMailBoxesList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>EMailBoxes</name>
    <attributes>
      <name>EMailBox</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/SLSRCA/SLSRCA.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SLSRCA</name>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AllowDifferenceInCountries</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionSpecialist</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Segments</name>
    <attributes>
      <name>Segment</name>
      <type>
        <types>CatalogRef.Сегменты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProcessLevels</name>
    <attributes>
      <name>ProcessLevel</name>
      <type>
        <types>CatalogRef.ProcessLevels</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/CommonModules/ImportExportСерверПовтИспСеанс/Module.bsl
// В этом модуле дублируются функции из других модулей, чтобы обеспечить повторное использование возвращаемых значений 

// ДОДЕЛАТЬ. ПЕРЕНЕСТИ ВЫЗЫВАЕМУЮ ФУНКЦИЮ В МОДУЛЬ МЕНЕДЖЕРА
Функция ПолучитьLegalEntityOfCountry(Country) Экспорт
	
	Возврат ImportExportСервер.ПолучитьLegalEntityOfCountry(Country);
	
КонецФункции

Функция ПолучитьLegalEntityПоРеквизитамTMS(CompanyCode, CountryCode, ERPID, FinanceLocCode, FinanceProcess) Экспорт
	
	Возврат Справочники.LegalEntities.ПолучитьПоРеквизитамTMS(CompanyCode, CountryCode, ERPID, FinanceLocCode, FinanceProcess);
	
КонецФункции

Функция ПолучитьRCACountryПоTMSID(TMSID) Экспорт
	
	Возврат Справочники.CountriesOfProcessLevels.ПолучитьПоTMSID(TMSID);
	
КонецФункции

Функция ПолучитьProcessLevelПоCountryCodeИTMSID(CountryCode, TMSID) Экспорт
	
	Возврат Справочники.ProcessLevels.ПолучитьПоCountryCodeИTMSID(CountryCode, TMSID);
	
КонецФункции

Функция ПолучитьProcessLevelПоRCACountry(RCACountry) Экспорт
	
	Возврат Справочники.ProcessLevels.ПолучитьПоRCACountry(RCACountry);
	
КонецФункции

Функция ПолучитьMOTПоTMSID(TMSID) Экспорт
	
	Возврат Справочники.MOTs.ПолучитьПоTMSID(TMSID);
	
КонецФункции

Функция ПолучитьCountryHUBПоTMSID(TMSID) Экспорт
	
	Возврат Справочники.CountriesHUBs.ПолучитьПоTMSID(TMSID);
	
КонецФункции

Функция ПолучитьPortПоTMSID(TMSID) Экспорт
	
	Возврат Справочники.SeaAndAirPorts.ПолучитьПоTMSID(TMSID);
	
КонецФункции

Функция ПолучитьAUПоКоду(Код) Экспорт
	
	Возврат Справочники.КостЦентры.ПолучитьПоКоду(Код);
	
КонецФункции

Функция ПолучитьIncotermsПоКоду(Код) Экспорт
	
	Возврат Справочники.Incoterms.ПолучитьПоКоду(Код);
	
КонецФункции

Функция ПолучитьConsignToПоTMSID(TMSID) Экспорт
	
	Возврат Справочники.ConsignTo.ПолучитьПоTMSID(TMSID);
	
КонецФункции

Функция ПолучитьCurrencyПоНаименованиюEng(НаименованиеEng) Экспорт
	
	Возврат Справочники.Валюты.ПолучитьПоНаименованиюEng(НаименованиеEng);
	
КонецФункции

Функция ПолучитьUOMПоTMSID(TMSID) Экспорт
	
	Возврат Справочники.UOMs.ПолучитьПоTMSID(TMSID);
	
КонецФункции

Функция ПолучитьUOMПоTMSIDForItemUOM(TMSID) Экспорт
	
	Возврат Справочники.UOMs.ПолучитьПоTMSIDForItemUOM(TMSID);
	
КонецФункции

Функция ПолучитьРеквизитыTMSContact(ContactGid) Экспорт
	
	Возврат Обработки.PullMasterDataFromTMS.ПолучитьРеквизитыContact(ContactGid);
	
КонецФункции

// { RGS VChaplygin 28.03.2016 23:38:15 - Добавим отправку от системной учетной записи
//Функция ПолучитьИнтернетПочтовыйПрофиль() Экспорт
Функция ПолучитьИнтернетПочтовыйПрофиль(ИспользоватьСистемнуюУчетнуюЗапись = Ложь) Экспорт
	
	// { RGS VChaplygin 28.03.2016 23:38:15 - Добавим отправку от системной учетной записи
	//Возврат ImportExportСервер.ПолучитьИнтернетПочтовыйПрофиль();
	Возврат ImportExportСервер.ПолучитьИнтернетПочтовыйПрофиль(ИспользоватьСистемнуюУчетнуюЗапись);
	// } RGS VChaplygin 28.03.2016 23:38:15 - Добавим отправку от системной учетной записи
	
КонецФункции

Функция ПолучитьИнтернетПочтовыйПрофильRCATLM() Экспорт
	
	Возврат ImportExportСервер.ПолучитьИнтернетПочтовыйПрофильRCATLM();
	
КонецФункции

Функция ПолучитьPackingTypeПоКоду(Код) Экспорт
	
	Возврат Справочники.PackingTypes.ПолучитьПоКоду(Код);
	
КонецФункции

Функция ПолучитьPackingTypeПоTMSID(TMSID) Экспорт
	
	Возврат Справочники.PackingTypes.ПолучитьПоTMSID(TMSID);
	
КонецФункции

Функция ПолучитьLocationQualifierПоКоду(Код) Экспорт
	
	Возврат Справочники.LocationQualifiers.ПолучитьПоКоду(Код);
	
КонецФункции

Функция ПолучитьContactQualifierПоDomainAndQualifier(DomainAndQualifier) Экспорт
	
	Возврат Справочники.ContactQualifiers.ПолучитьПоDomainAndQualifier(DomainAndQualifier);
	
КонецФункции

Функция ПолучитьSLSRCAПоКоду(Код) Экспорт
	
	Возврат Справочники.SLSRCA.ПолучитьПоКоду(Код);
	
КонецФункции

Функция ПолучитьParentCompanyПоКоду(Код) Экспорт
	
	Возврат Справочники.SoldTo.НайтиПоКоду(Код);
	
КонецФункции

Функция ПолучитьИсключаемыеИзЗатратERPTreatments() Экспорт
	
	МассивERPTreatments = Новый Массив;
	
	МассивERPTreatments.Добавить(Перечисления.ТипыЗаказа.A);
	МассивERPTreatments.Добавить(Перечисления.ТипыЗаказа.I);
			
	Возврат МассивERPTreatments;
	
КонецФункции

Функция ПолучитьERPTreatmentsДляКоторыхОбязателенСерийныйНомер() Экспорт
	
	МассивERPTreatments = Новый Массив;
	
	МассивERPTreatments.Добавить(Перечисления.ТипыЗаказа.A);
	МассивERPTreatments.Добавить(Перечисления.ТипыЗаказа.U);
	МассивERPTreatments.Добавить(Перечисления.ТипыЗаказа.V);
	МассивERPTreatments.Добавить(Перечисления.ТипыЗаказа.LOAN);
	МассивERPTreatments.Добавить(Перечисления.ТипыЗаказа.FAT);
			
	Возврат МассивERPTreatments;
	
КонецФункции
